app/models/shortened_url.rb

INSERT INTO "shortened_urls" ("long_url", "short_url", "submitter_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["long_url", "test@gmail.com"], ["short_url", "YRAhXpmi_vFKu7KmLeXOOg"], ["submitter_id", 1], ["created_at", "2020-07-09 02:16:47.631566"], ["updated_at", "2020-07-09 02:16:47.631566"]]
---
  def self.create_for_user_and_long_url!(user, long_url)
    ShortenedUrl.create!(
      submitter_id: user.id,
      long_url: long_url,
      short_url: ShortenedUrl.random_code
    )

SELECT 1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "YRAhXpmi_vFKu7KmLeXOOg"], ["LIMIT", 1]]
---
  def self.random_code
    loop do
      random_code = SecureRandom.urlsafe_base64(16)
      return random_code unless ShortenedUrl.exists?(short_url: random_code)

SELECT "shortened_urls".* FROM "shortened_urls" WHERE (created_at >= '2020-07-09 02:15:47.625832') AND "shortened_urls"."submitter_id" = $1  [["submitter_id", 1]]
---
  def no_spamming
    last_minute = ShortenedUrl
      .where('created_at >= ?', 1.minute.ago)
      .where(submitter_id: submitter_id)
      .length

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "shortened_urls".* FROM "shortened_urls" WHERE "shortened_urls"."submitter_id" = $1  [["submitter_id", 1]]
---
  def nonpremium_max
    return if User.find(self.submitter_id).premium

    number_of_urls =
      ShortenedUrl
        .where(submitter_id: submitter_id)
        .length